app/controllers/events_controller.rb

INSERT INTO "events" ("week", "day", "hour", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["week", 3], ["day", "seg"], ["hour", 6], ["user_id", 2], ["created_at", "2016-01-20 03:14:19.025988"], ["updated_at", "2016-01-20 03:14:19.025988"]]
---
  def create
    event = current_user.events.build(event_params)
    if event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 4]]
---
  def destroy
    event = Event.find(id)
    event.destroy