app/controllers/scheduler_controller.rb

  def index
    @current_week = Date.today.cweek
    events = Event.where(week: @current_week)
---
SELECT  "events".* FROM "events" WHERE "events"."week" = $1 LIMIT 1  [["week", 3]]