app/controllers/welcome_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."week" = $1 LIMIT 1  [["week", 3]]
---
  def index
    current_week = Date.today.cweek
    @events = Event.find_by_week(current_week)